## Plan output

```
module.backend.data.aws_caller_identity.identity: Reading...
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=208545079485]
module.macie["us-east-2"].data.aws_region.current: Reading...
module.macie["us-east-2"].data.aws_region.current: Read complete after 0s [id=us-east-2]
module.macie["us-east-1"].data.aws_region.current: Reading...
module.macie["us-west-2"].data.aws_region.current: Reading...
module.macie["us-west-1"].data.aws_region.current: Reading...
module.macie["us-west-1"].data.aws_region.current: Read complete after 0s [id=us-west-1]
module.macie["us-east-1"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.macie["us-west-2"].data.aws_region.current: Read complete after 0s [id=us-west-2]
module.macie["us-west-2"].data.external.template_id: Reading...
module.macie["us-east-1"].data.external.template_id: Reading...
module.macie["us-east-2"].data.external.template_id: Reading...
module.macie["us-west-1"].data.external.template_id: Reading...
module.macie["us-west-1"].data.external.template_id: Read complete after 7s [id=-]
module.macie["us-west-2"].data.external.template_id: Read complete after 7s [id=-]
module.macie["us-east-1"].data.external.template_id: Read complete after 7s [id=-]
module.macie["us-east-2"].data.external.template_id: Read complete after 7s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # module.backend.aws_s3_bucket_lifecycle_configuration.tfstate will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "tfstate" {
        id                                     = "security-production-tfstate-20250226170802389800000001"
        # (2 unchanged attributes hidden)

      ~ rule {
            id     = "state"
          + prefix = (known after apply)
            # (1 unchanged attribute hidden)

          + filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
            }

          ~ noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```